<template>
    <div style="display: flex; flex-direction: column; align-items: center;">
        <div style="display: flex; gap: 16px;">
            <div
                v-for="faction in factions"
                :key="faction.id"
                :class="['card', { 'isActive': selectedFaction === faction.name }]"
                style="width: 33%"
                @click="selectFaction(faction)"
            >
                <img class="card__img" :src="faction.image" :alt="faction.name" />
                <h3 class="card__title">{{ faction.name }}</h3>
                <p class="card__text">{{ faction.description }}</p>

            </div>
        </div>


        <button class="btn btn--primary" @click="nextStep" :disabled="!selectedFaction">Next</button>
    </div>
</template>

<script>
export default {
    data() {
        return {
            selectedFaction: null,
            factions: [
                {
                    id: 1,
                    name: 'Корпорация Глобалис',
                    description: 'Корпорация Глобалис - могучий и влиятельный монополист в мире киберпанка. Она контролирует огромные ресурсы, включая передовые технологии, и доминирует на мировом рынке. Внутри компании царит строгая и безжалостная иерархия, где только самые способные и беспощадные сотрудники могут добиться успеха. Корпорация Глобалис разрабатывает киберинтерфейсы, искусственный интеллект, киберпротезы и умные города. В то время как она предоставляет многочисленные удобства и технологические решения, ее деятельность также вызывает волнения из-за возможности массового контроля и угрозы приватности человека.',
                    image: '/images/f1.svg',
                },
                {
                    id: 2,
                    name: 'Синдикат Нефтезаряда',
                    description: 'Синдикат Нефтезаряда - таинственный киберпреступный синдикат, специализирующийся на контрабанде и кибертерроризме. Эта фракция занимается незаконными операциями, такими как кража ценных технологий, шантаж и хакерские атаки на крупные корпорации. Синдикат пользуется глубокими знаниями в области киберпространства и всегда находится в поиске средств для дестабилизации корпоративного мира и нарушения мирового порядка. Внешне они остаются скрытыми в тени, управляя своими операциями через сеть анонимных хакерских лейеров.',
                    image: '/images/f2.svg',
                },
                {
                    id: 3,
                    name: 'Анархохакеры Кибернетики',
                    description: 'Анархохакеры Кибернетики - группировка киберактивистов, которая стремится к свободе информации и отказу от корпоративного контроля. Они верят, что все технологии должны быть доступны каждому человеку и не подвержены цензуре или манипуляции. Анархохакеры считают себя стражами киберпространства, борясь против корпораций и правительств, которые стремятся манипулировать людьми через технологии. Они проводят децентрализованные атаки и взломы, чтобы раскрыть скрытую правду и бороться за свободу виртуального мира. Внешне они скрывают свои истинные лица за кибермасками и носят символы анонимности и свободы на своей одежде.',
                    image: '/images/f3.svg',
                },
            ],
        };
    },
    methods: {
        selectFaction(faction) {
            this.selectedFaction = faction.name;
        },
        nextStep() {
            this.$store.commit('SET_FACTION', this.selectedFaction);
            this.$emit('next');
        },
    },
};
</script>
